### Import libraries.

In [1]:
import pandas as pd
import numpy as np
import string
from functions import to_snake_case
from functions import round_up_time
import pickle

#### Data Source [UCI Machine Learning Repository](http://archive.ics.uci.edu/ml/datasets/Occupancy+Detection+#)

### Read the dataset into a dataframe object.

In [2]:
df1 = pd.read_csv('../datasets/datatraining.txt')
df2 = pd.read_csv('../datasets/datatest.txt')
df3 = pd.read_csv('../datasets/datatest2.txt')

### Merge all datasets into one large dataframe for cleaning purposes.

In [3]:
df = pd.concat([df1, df2], ignore_index=True)
df = pd.concat([df1, df3], ignore_index=True)

### Check for duplicate observations. 
#### There are none.

In [4]:
df.duplicated().value_counts()

False    17895
dtype: int64

### Check the shape of the dataframe.

In [5]:
df.shape, df1.shape, df2.shape, df3.shape

((17895, 7), (8143, 7), (2665, 7), (9752, 7))

### Peek at the data.

In [6]:
df.head()

,date,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
0,2015-02-04 17:51:00,23.18,27.2720,426.0,721.25,0.004793,1
1,2015-02-04 17:51:59,23.15,27.2675,429.5,714.00,0.004783,1
2,2015-02-04 17:53:00,23.15,27.2450,426.0,713.50,0.004779,1
3,2015-02-04 17:54:00,23.15,27.2000,426.0,708.25,0.004772,1
4,2015-02-04 17:55:00,23.10,27.2000,426.0,704.50,0.004757,1

In [7]:
df1.describe()

,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
count,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000
mean,20.619084,25.731507,119.519375,606.546243,0.003863,0.212330
std,1.016916,5.531211,194.755805,314.320877,0.000852,0.408982
min,19.000000,16.745000,0.000000,412.750000,0.002674,0.000000
25%,19.700000,20.200000,0.000000,439.000000,0.003078,0.000000
50%,20.390000,26.222500,0.000000,453.500000,0.003801,0.000000
75%,21.390000,30.533333,256.375000,638.833333,0.004352,0.000000
max,23.180000,39.117500,1546.333333,2028.500000,0.006476,1.000000

In [8]:
df2.describe()

,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
count,2665.000000,2665.000000,2665.000000,2665.000000,2665.000000,2665.000000
mean,21.433876,25.353937,193.227556,717.906470,0.004027,0.364728
std,1.028024,2.436842,250.210906,292.681718,0.000611,0.481444
min,20.200000,22.100000,0.000000,427.500000,0.003303,0.000000
25%,20.650000,23.260000,0.000000,466.000000,0.003529,0.000000
50%,20.890000,25.000000,0.000000,580.500000,0.003815,0.000000
75%,22.356667,26.856667,442.500000,956.333333,0.004532,1.000000
max,24.408333,31.472500,1697.250000,1402.250000,0.005378,1.000000

In [9]:
df3.describe()

,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
count,9752.000000,9752.000000,9752.000000,9752.000000,9752.000000,9752.000000
mean,21.001768,29.891910,123.067930,753.224832,0.004589,0.210111
std,1.020693,3.952844,208.221275,297.096114,0.000531,0.407408
min,19.500000,21.865000,0.000000,484.666667,0.003275,0.000000
25%,20.290000,26.642083,0.000000,542.312500,0.004196,0.000000
50%,20.790000,30.200000,0.000000,639.000000,0.004593,0.000000
75%,21.533333,32.700000,208.250000,831.125000,0.004998,0.000000
max,24.390000,39.500000,1581.000000,2076.500000,0.005769,1.000000

#### Round up timestamp with '59' for a clear timestamp pattern (these may have caused some issues with ARIMA)

In [10]:
df['date'] = df['date'].map(lambda x: round_up_time(x))

In [11]:
len([timestamp for timestamp in df['date'] if ':59:59' in timestamp])

0

In [12]:
len([timestamp for timestamp in df['date'] if ':59' in timestamp[16:]])

0

In [13]:
df1['date'] = df1['date'].map(lambda x: round_up_time(x))
df2['date'] = df2['date'].map(lambda x: round_up_time(x))
df3['date'] = df3['date'].map(lambda x: round_up_time(x))

### Check for missing values.
#### There are none.

In [14]:
df.isnull().sum()

date             0
Temperature      0
Humidity         0
Light            0
CO2              0
HumidityRatio    0
Occupancy        0
dtype: int64

### Check the data types for each column.
#### Notice date is not in DateTime format.  
#### We will need to convert to allow time series indexing.

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17895 entries, 0 to 17894
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           17895 non-null  object
 1   Temperature    17895 non-null  float64
 2   Humidity       17895 non-null  float64
 3   Light          17895 non-null  float64
 4   CO2            17895 non-null  float64
 5   HumidityRatio  17895 non-null  float64
 6   Occupancy      17895 non-null  int64
dtypes: float64(5), int64(1), object(1)
memory usage: 978.8+ KB

### Rename all columns to follow snake-case conventions.

In [16]:
df.columns = df.columns.map(lambda x: to_snake_case(x))

In [17]:
df1.columns = df1.columns.map(lambda x: to_snake_case(x))
df2.columns = df2.columns.map(lambda x: to_snake_case(x))
df3.columns = df3.columns.map(lambda x: to_snake_case(x))

In [18]:
df.head()

,date,temperature,humidity,light,co2,humidity_ratio,occupancy
0,2015-02-04 17:51:00,23.18,27.2720,426.0,721.25,0.004793,1
1,2015-02-04 17:52:00,23.15,27.2675,429.5,714.00,0.004783,1
2,2015-02-04 17:53:00,23.15,27.2450,426.0,713.50,0.004779,1
3,2015-02-04 17:54:00,23.15,27.2000,426.0,708.25,0.004772,1
4,2015-02-04 17:55:00,23.10,27.2000,426.0,704.50,0.004757,1

### Sort the observations by the date column.
#### We need the date column sorted in ascending order in preparation for time series indexing.

In [19]:
df.sort_values(by='date', inplace=True)

In [20]:
df1.sort_values(by='date', inplace=True)
df2.sort_values(by='date', inplace=True)
df3.sort_values(by='date', inplace=True)

In [21]:
df.head()

,date,temperature,humidity,light,co2,humidity_ratio,occupancy
0,2015-02-04 17:51:00,23.18,27.2720,426.0,721.25,0.004793,1
1,2015-02-04 17:52:00,23.15,27.2675,429.5,714.00,0.004783,1
2,2015-02-04 17:53:00,23.15,27.2450,426.0,713.50,0.004779,1
3,2015-02-04 17:54:00,23.15,27.2000,426.0,708.25,0.004772,1
4,2015-02-04 17:55:00,23.10,27.2000,426.0,704.50,0.004757,1

In [22]:
df.tail()

,date,temperature,humidity,light,co2,humidity_ratio,occupancy
17890,2015-02-18 09:15:00,20.815,27.7175,429.75,1505.25,0.004213,1
17891,2015-02-18 09:16:00,20.865,27.7450,423.50,1514.50,0.004230,1
17892,2015-02-18 09:17:00,20.890,27.7450,423.50,1521.50,0.004237,1
17893,2015-02-18 09:18:00,20.890,28.0225,418.75,1632.00,0.004279,1
17894,2015-02-18 09:19:00,21.000,28.1000,409.00,1864.00,0.004321,1

### Save the cleaned dataset to a csv file for later use.

In [23]:
df.to_csv('../datasets/occupancy.csv')

In [24]:
df1.to_csv('../datasets/train.csv')
df2.to_csv('../datasets/test.csv')
df3.to_csv('../datasets/test2.csv')

### Create time series index using the date column.

#### Convert the date column from object/string type to DateTime type.

In [25]:
df['date'] = df['date'].map(lambda x: pd.to_datetime(x))

In [26]:
df1['date'] = df1['date'].map(lambda x: pd.to_datetime(x))
df2['date'] = df2['date'].map(lambda x: pd.to_datetime(x))
df3['date'] = df3['date'].map(lambda x: pd.to_datetime(x))

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17895 entries, 0 to 17894
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   date            17895 non-null  datetime64[ns]
 1   temperature     17895 non-null  float64
 2   humidity        17895 non-null  float64
 3   light           17895 non-null  float64
 4   co2             17895 non-null  float64
 5   humidity_ratio  17895 non-null  float64
 6   occupancy       17895 non-null  int64
dtypes: datetime64[ns](1), float64(5), int64(1)
memory usage: 1.1 MB

In [28]:
df.set_index('date', inplace=True)

In [29]:
df1.set_index('date', inplace=True)
df2.set_index('date', inplace=True)
df3.set_index('date', inplace=True)

In [30]:
df.head()

,temperature,humidity,light,co2,humidity_ratio,occupancy
date,,,,,,
2015-02-04 17:51:00,23.18,27.2720,426.0,721.25,0.004793,1
2015-02-04 17:52:00,23.15,27.2675,429.5,714.00,0.004783,1
2015-02-04 17:53:00,23.15,27.2450,426.0,713.50,0.004779,1
2015-02-04 17:54:00,23.15,27.2000,426.0,708.25,0.004772,1
2015-02-04 17:55:00,23.10,27.2000,426.0,704.50,0.004757,1

In [31]:
df.sort_index(inplace=True)

In [32]:
df1.sort_index(inplace=True)
df2.sort_index(inplace=True)
df3.sort_index(inplace=True)

In [33]:
df.head()

,temperature,humidity,light,co2,humidity_ratio,occupancy
date,,,,,,
2015-02-04 17:51:00,23.18,27.2720,426.0,721.25,0.004793,1
2015-02-04 17:52:00,23.15,27.2675,429.5,714.00,0.004783,1
2015-02-04 17:53:00,23.15,27.2450,426.0,713.50,0.004779,1
2015-02-04 17:54:00,23.15,27.2000,426.0,708.25,0.004772,1
2015-02-04 17:55:00,23.10,27.2000,426.0,704.50,0.004757,1

In [34]:
df.tail()

,temperature,humidity,light,co2,humidity_ratio,occupancy
date,,,,,,
2015-02-18 09:15:00,20.815,27.7175,429.75,1505.25,0.004213,1
2015-02-18 09:16:00,20.865,27.7450,423.50,1514.50,0.004230,1
2015-02-18 09:17:00,20.890,27.7450,423.50,1521.50,0.004237,1
2015-02-18 09:18:00,20.890,28.0225,418.75,1632.00,0.004279,1
2015-02-18 09:19:00,21.000,28.1000,409.00,1864.00,0.004321,1

### Picke the data for later use. This will preserve the time series indexing.

In [35]:
df.to_pickle('../datasets/occupancy.p')

In [36]:
df1.to_pickle('../datasets/train.p')
df2.to_pickle('../datasets/test.p')
df3.to_pickle('../datasets/test2.p')